import ChapterTextContent from "@/components/chapter-text-content";
import { Metadata } from "next";

export const metadata: Metadata = {
   title: "Розділ 1. Хіба це не повинен був бути епілог?",
   description: "Розділ 1. Хіба це не повинен був бути епілог?",
}

const chapterText = `<div class="text-content"><p>Я жил припеваючи. Мои родители были абсолютно здоровы и посещали теннисный клуб каждые выходные. Я не нуждался в дополнительных доходах от подработки, дабы оплатить учёбу. Я был вполне обычным школьником, наслаждавшимся играми, фильмами, мангой и новеллами. Именно так всё обстояло в моей жизни десять лет назад.</p>

<p>- Спустя эти десять лет я не могу понять… Почему именно я? Фэнтезийные миры должны быть центром поддержки для инвалидов, социальных изгоев, своего рода Гринпис для обездоленных. По крайней мере, так было в новеллах и манге.</p>

<p>Вот есть те, над кем в школе издеваются, или те, кто ведёт затворнический образ жизни. Таких людей призывают в подобный мир, оказывают материальную и духовную поддержку, чтобы они радовались жизни и наслаждались приключениями. Оглядываясь назад, могу сказать, что развитие событий в подобных историях было действительно убогим.</p>

<p>Вот почему всё это должно было быть какой-то ошибкой.</p>

<p>- Пойми, на Земле у меня всё было отлично. Я был вполне состоятельным человеком, каждый день проводившим время с друзьями за обсуждением новелл и манги. Да я жил лучше любого из моих школьных друзей. Я мог разбрасываться деньгами у них на глазах, в то время как они скачивали игры с пиратских торрент-трекеров и довольствовались походами на бесплатные мероприятия. Для полноты картины мне лишь не хватало более смазливого личика… Хотя нет, забудь. Суть в другом. Почему кто-то вроде меня должен был быть поставлен в один ряд с этими неудачниками? Ты ведь тоже считаешь, что это неправильно, да? – посмотрел я на павшего товарища, ища согласия.</p>

<p>Он всё ещё подавал признаки жизни, но я был уверен в том, что никто из них не выживет. Если бы я сейчас находился в Корее, и кто-то, ставший свидетелем сцены зверского убийства, вызвал бы полицию, меня бы ждали крупные неприятности… Однако, это не Земля. В этом мире правят те, у кого есть сила. Утопия для дикарей. Это мир, где с помощью грубой физической силы ты можешь добиться богатства, славы, власти, женщин.</p>

<p>- Больной ублюдок…</p>

<p>Даже полные злобы слова моего умирающего товарища не могли поколебать меня. Для меня это было не больше, чем лай дворовой шавки.</p>

<p>- Называть великого героя, который сразит Владыку Демонов и спасёт человечество, больным ублюдком? С ума сошёл?</p>

<p>Я был героем, избранным апостолом правосудия. Это не я присвоил себе такой титул. Те, кто призвал меня в этот мир, называли меня так, как им вздумается. Они говорили, что я герой из легенд, который спасёт этот мир.</p>

<p>- Кто-то вроде тебя не может быть героем… Кха!</p>

<p>- Это твои последние слова?</p>

<p>Захлебнувшийся кровью товарищ уже ничего не мог сказать. Никто из них уже не мог со злобой смотреть на меня. Я повернулся спиной к трупам товарищей, валявшихся на холодном полу.</p>

<p>Принцесса Меча, Король Фей, Мудрец, Король Наёмников.</p>

<p>Они были героями, которые в своё время значительно превосходили меня в силе. Но в настоящий момент, спустя десять лет после насильственного призыва в этот мир, никто из них не мог соперничать со мной в схватке один на один. Поэтому я избавился от них. Прямо перед самой битвой с Владыкой Демонов я застал их врасплох.</p>

<p>- Эй, ещё чего сказать хотите, если вы вдруг живы?</p>

<p>Лишь тишина была ему ответом.</p>

<p>- Разве вы не собирались избавиться и от меня после убийства Владыки Демонов? Ха! Меня так просто не провести!</p>

<p>Я вышел победителем благодаря разнице в системе наших ценностей. Для моих товарищей это был мир, где они родились и выросли. Если герой проиграет Владыке Демонов, то их семьи, друзья и любимые окажутся во власти демонов. Они не могли безрассудно напасть на него.</p>

<p>А что же насчёт меня? Мне было плевать, что случится с этим миром. Я собирался убить Владыку Демонов и вернуться на Землю к своей семье. Теперь на моём пути не оставалось никаких препятствий.</p>

<p>По всему тёмному коридору были разбросаны кости и плоть. Лужи крови под ногами густо пропитали мои ботинки. Здесь были трупы людей, трупы монстров, трупы демонов. Кто-то отдал жизнь за то, чтобы герой сюда добрался, а кто-то наоборот, чтобы не подпустить его к Владыке Демонов.</p>

<p>- Г-герой! Почему?.. – раздался голос умирающего наёмника, прислонившегося к холодной стене.</p>

<p>&nbsp;“Ого, выживший? Его вроде звали… Пусть будет просто Наёмник А”</p>

<p>Это был близкий последователь Короля Наёмников. Я запомнил его как славного парня, который напевал песню даже в самых тяжёлых ситуациях.</p>

<p>- Почему я убил своих товарищей? Не переживай об этом. Я сам смогу разобраться с Владыкой Демонов. Теперь, когда я избавился от своих назойливых напарников, я нахожусь на пике своих способностей, - успокаивающим голосом ответил я Наёмнику А.</p>

<p>Наступила тишина.</p>

<p>- Ты даже не собираешься напевать песню?</p>

<p>Я начал напевать мелодию себе под нос вместо Наёмника А, продвигаясь дальше по коридору. Я беззаботно перепрыгивал через трупы на своём пути. Моя поступь была лёгкой, как у юной барышни, вышедшей на прогулку в чудесный цветочный сад. Если бы не чешуйчатый доспех, сделанный для меня Королём Драконов, я бы, наверное, парил в воздухе.</p>

<p>- Хммм ~♫ хухуху ~♪</p>

<p>У меня было отличное настроение. Могу поклясться, мне не было так хорошо даже когда в мои объятия пала первая красавица континента.</p>

<p>*БАХ*</p>

<p>Со всей силы я пнул вычурную деревянную дверь, преграждающую мне путь.</p>

<p>*ХРЯСЬ, БАБАХ*</p>

<p>Не выдержавшая такого удара дверь разлетелась в щепки. Представший передо мной тронный зал был таким необъятным, что сложно было поверить, будто я нахожусь внутри помещения. Но всё же кое-что в этом огромном зале сразу бросалось в глаза.</p>

<p>- Итак, ты достиг этого места, избранный герой!</p>

<p>На противоположном от входа конце зала стоял трон, украшенный драгоценными камнями различного цвета. Сидящий на нём демон медленно встал, будто приветствуя меня.</p>

<p>Возле его острых ушей виднелись огромные рога, символизировавшие демонов. Но они были более крупными и красиво украшенными, в отличие от тех, что я замечал у ранее встречавшихся мне демонов. Поэтому мне не сложно было догадаться, кто находился перед моими глазами.</p>

<p>- Это ты Владыка Демонов?</p>

<p>- Верно. Я – само зло! Я Педонар! Я тот, кто погрузит этот мир во тьму!</p>

<p>Чёрные миазмы вырвалась из тела Владыки Демонов после того, как он представился. Увидев эту впечатляющую демонстрацию силы, я убедился, что передо мной не очередной клон, подделка, которых я уже устал убивать за эти десять лет. Это настоящий Владыка Демонов Педонар, мой билет на Землю. Он даже не представляет, как я ждал этого момента.</p>

<p>- Хаха! Герой, твои глаза полны решимости, мне это нравится! Да будет так! Я принимаю вызов, брошенный мне человечеством!</p>

<p>- Погоди. Прежде чем мы сразимся, я хочу кое-что спросить. Почему ты просто ждал и наблюдал, как умирают твои подчинённые?</p>

<p>Это был вопрос, который мучал меня эти десять лет. И другого шанса его задать у меня уже не будет.</p>

<p>Владыка Демонов Педонар нахмурился в ответ. Похоже, его настроение испортилось.</p>

<p>- Просто ждал и наблюдал? Как грубо. Я всегда отправлял своих сильнейших подчинённых, дабы отомстить.</p>

<p>- И они погибали.</p>

<p>- Тогда я посылал ещё более сильных подчинённых.</p>

<p>- И они тоже погибали.</p>

<p>- Герой, неужели ты недоволен тем, что тебе посчастливилось выжить?</p>

<p>Он словно упрекал меня и смотрел так, будто я сказал нечто глупое.</p>

<p>- Если бы уважаемый Владыка Демонов действовал с самого начала, оказался бы я здесь сейчас?</p>

<p>За последние десять лет Владыка Демонов многое потерял.</p>

<p>План по захвату королевства, заговор, связанный с убийством героя, лояльные подчинённые, выдающийся сын, красивые рабы, первоклассный элитный легион демонов, снаряжение высочайшего класса, горы сокровищ, огромные территории… Всего и не перечислить.</p>

<p>И каждый раз, когда он что-то терял, я становился сильнее. Моим крупнейшим спонсором было не человечество, а сам Владыка Демонов.</p>

<p>- Герой, эти домыслы бессмысленны.</p>

<p>- Они точно не бессмысл…</p>

<p>- Ты знаешь политику демонов? В противном случае помолчи.</p>

<p>Похоже, дальше продолжать разговор было бесполезно. Вопрос, который я хотел задать на протяжении этих десяти лет, так и останется без ответа…</p>

<p>&nbsp;</p>

<p>***</p>

<p>&nbsp;</p>

<p>Каждый раз, когда я отправлялся на исследование древних храмов, лабиринтов, руин и прочих мест, словно специально подготовленных для героя, который однажды появится в этом мире, я не испытывал никаких проблем даже без “силы дружбы”, о которой я постоянно слышал. Я был силён даже без мотивации кого-то или что-то защитить. Моей важнейшей целью был побег из этого варварского мира и возвращение в нормальную земную цивилизацию. Этой мотивации было для меня вполне достаточно.</p>

<p>Я не зря терпел эти десять лет. И мне не понадобились никакие хитрости и уловки.</p>

<p>- Кх! Герой, неужели твоя могущественная сила исходит из ярости от потери своих товарищей?</p>

<p>- Нет, это результат тренировок.</p>

<p>О какой ярости может идти речь, если я сам их убил? На самом деле я чувствовал себя довольно таки свежо и бодро.</p>

<p>- В-вот как? В любом случае, это был отличный бой…</p>

<p>Глаза Владыки Демонов Педонара, который проиграл в честном дуэльном поединке на мечах, медленно закрылись.</p>

<p>Я ждал, ни на мгновение не расслабляясь.</p>

<p>1 секунда, 2 секунды, 5 секунд, 10 секунд…</p>

<p>Но мёртвый Владыка Демонов не двигался. Не было никакого внезапного поворота событий, когда противник подымается и говорит: “А теперь я сражусь в полную силу!”</p>

<p>- Ты серьёзно? Это конец? Эй?</p>

<p>Ничто не нарушало тишину.</p>

<p>- Мда…</p>

<p>Я десять лет усердно трудился, дабы одолеть Владыку Демонов. И всё закончилось так просто? Глядя на его труп, распластавшийся передо мной, мне хотелось сильно выругаться.</p>

<p>У меня в голове всплыл список имён этих ублюдков, которые чрезмерно преувеличивали возможности Владыки Демонов, но поскольку у меня великодушное сердце, я решил быть милостивым и не тратить на это время.</p>

<p>- О, Бог фэнтезийного мира! Я одолел Владыку Демонов, как и обещал! Пожалуйста, верни меня на Землю! – прокричал я, подняв взгляд к небесам.</p>

<p>Не было смысла сожалеть о прошлом. Я лишь думал о том, чем займусь на Земле. Буду хорошим сыном, начну встречаться с девушкой, буду играть в игры, наслаждаться дивными блюдами, поучаствую в Олимпиаде, отправлюсь на поиски справедливости…</p>

<p>Я с нетерпением ждал возвращения на Землю.</p>

<p>Сообщение</p>

<p>▷ Уважаемый Герой. Было ли ваше приключение увлекательным?</p>

<p>- Да-да. А теперь побыстрее верните меня на Зем…</p>

<p>Сообщение</p>

<p>▷ Путь настоящего героя действительно тяжёлый. Но обретя бесчисленные узы, которые вдохновили вас, вы не потеряли надежду и продолжали верить. Вы познали дружбу и любовь, и после совместного взросления вы, наконец, одолели злобного Владыку Демонов. Примите же поздравления!</p>

<p>Сообщение</p>

<p>▷ Давайте же взглянем на ваши оценки.</p>

<p>- Погодите! Какие ещё оценки?</p>

<p>Я впервые об этом слышал. Никогда не подводившая меня интуиция била тревогу, намекая, что происходит нечто странное.</p>

<p>Сообщение</p>

<p>▷ Пожалуйста, проверьте свой табель успеваемости.</p>

<p>▷ Имя: Кан Хан Су</p>

<p>▷ Боевая мощь: S</p>

<p>▷ Достижения: A-</p>

<p>▷ Репутация: D+</p>

<p>▷ Личность: F</p>

<p>▷ Примечание: Какого чёрта вы поубивали своих замечательных товарищей?</p>

<p>С чего это они замечательные?</p>

<p>Мои товарищи постоянно вмешивались в мою жизнь и навязывали свои ценности. Они пренебрегали правами человека, а применение насилия под видом тренировок было в порядке вещей. Одна сумасшедшая сука вообще по своей же неосторожности предстала передо мной в неглиже, и тут же обнажила против меня меч.</p>

<p>Если бы мне пришлось составить список случаев неразумного и необоснованного поведения в отношении меня за последние десять лет, ему бы не было конца. Так что это была справедливая месть…</p>

<p>Сообщение</p>

<p>▷ Вы провалили тест.</p>

<p>▷ Причина: С большой силой приходит и большая ответственность. Но ваша личность не соответствует приобретённой силе. Ради порядка и соблюдения мира на континенте, вы должны вернуться к первому дню теста.</p>

<p>▷ Начало переаттестации.</p>

<p>- Вернуться? Переаттестация? Это что ещё за херня?!</p>

<p>Не важно, что там у Бога на уме, но это было недопустимо. Снова барахтаться в этой мусорной свалке, в которой даже нет унитазов? Наблюдать, как вернутся к жизни товарищи, ради убийства которых я приложил столько усилий?</p>

<p>От одной лишь этой мысли по всему телу пошли мурашки.</p>

<p>Странное свечение окутало моё тело.</p>

<p>Сообщение</p>

<p>▷ Преподавательский состав будет молиться за ваш успех!</p>

<p>▷ Вам присвоен титул “Синий Сокол”.</p>

<p>▷ Вам в помощь назначен особый инструктор.</p>

<p>- Чёрт бы вас побрал…</p></div>`



export default function ChapterPage() {
   return (
      <div>
         <main className="container mx-auto">
            <h1 className="lg:text-3xl text-2xl font-bold">Розділ 1. Хіба це не повинен був бути епілог?</h1>
            <ChapterTextContent text={chapterText} />
         </main>
      </div>
   )
}