[
    {
        "id": 1,
        "img": "https://cover.imgslib.link/uploads/cover/legend-of-the-arch-magus-novel/background/02qfa7Rz1VJI",
        "title": "Даю першу оцінку, постараюсь в дальнейшем бути точним!!",
        "body": "Цей твір я читаю вже близько року або більше, відповідно багато чого забув і враження вже не ті) Загалом класичний твір про досить сильного гг, для інтересу можна подивитися, але останні глави загалом цікаві і можна витратити час, чи варто воно того? Дуже спірно, адже на сайтах є і набагато кращі новели, якщо ви любите загалом спокійного, зрілого і сильного гг, то сміливо беріться. Раджу читати повільно і з задоволенням, адже хороших книг мало і треба цінувати те, що маємо! Удачі вам.",
        "views": "117",
        "likes": "1",
        "type": {
            "id": 2,
            "title": "Нейтральний"
        }
    },
    {
        "id": 2,
        "img": "https://cover.imgslib.link/uploads/cover/1-ldk-soshite-2-jk/cover/PyLRz98Kv5JK_250x350.jpg",
        "title": "Легкий ромком",
        "body": "Прочитав у 21 році, коли я ще тільки починав читати книжки. Тоді я занурився в це з задоволенням, але через 3 роки вже бачу, що в принципі це звичайний ромком. Легке читання без сильної навантаження, зі своїми кліше і іншим. А якщо ви знайомі з роботою «Сбрил бороду. Подобрал старшеклассницу», то анотація перекладача може допомогти: Якщо ви любитель такого, то можливо і зайде. ",
        "views": "267",
        "likes": "0",
        "type": {
            "id": 2,
            "title": "Нейтральний"
        }
    },
    {
        "id": 3,
        "img": "https://cover.imgslib.link/uploads/cover/blog-nablyudatelya-novel/cover/pzf7jAMEnDTj_250x350.jpg",
        "title": "Коментар спостерігача",
        "body": "Чесно кажучи, починаючи читати цей твір, я не думав, що вийде настільки добре. Автор дійсно зміг не тільки зацікавити мене, але й донести деякі думки, та й загалом, було приємно провести час за читанням цього творіння. Забігаючи наперед скажу - в «Блозі» ви не побачите філософських роздумів, глибокого сенсу і інших похідних СПГС. «Блог спостерігача» - дійсно блог і написаний він відповідно. Багато повсякденності в купе з відмінним гумором і великою кількістю відсилань, в основному, на інтернет-культуру (на меми, будемо прямолінійними). Як-не-як, пишеться все від особи молодої ",
        "views": "302",
        "likes": "302",
        "type": {
            "id": 1,
            "title": "Позитивний"
        }
    },
    {
        "id": 4,
        "img": "https://cover.imgslib.link/uploads/cover/beginning-after-the-end-novel/background/nnzGXOGthlj6",
        "title": "Одне з найкращих.",
        "body": "Це одна з найкращих новел, які я коли-небудь читав. Але про все по порядку, не так ли? Персонажі. Насправді, не буду лукавити, багато хто досить шаблонні, але це легко покривається харизмою головного героя і другорядних персонажів (не всіх), також дуже тонке і поступове зміна внутрішнього світу порой настільки шокує, що в якийсь момент ти стоїш і розумієш - в початку він таким не був.. Починаєш перебирати всі події і дії і хоп, розумієш вот оно, маленький шматочок, з чого все почалося. Цей аспект не залишить вас байдужим. ",
        "views": "429",
        "likes": "11",
        "type": {
            "id": 2,
            "title": "Нейтральний"
        }
    }
]